/*
*********************************************************************************************************
*
*	模块名称 : 模块
*	文件名称 : .h
*	说    明 : 
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0    xxx-xx-xx
*
*	Copyright (C), 2014-2019, 德致伦电子
*
*********************************************************************************************************
*/
#ifndef __BSP_DAC_H
#define __BSP_DAC_H

#include "sys.h"

/*函数申明*/

void bsp_InitDac1(void);
void Dac1_Set_Vol(uint16_t vol);

#endif


/***************************** 德致伦电子 DeZLinc (END OF FILE) *********************************/
