/*
*********************************************************************************************************
*
*	模块名称 : 蜂鸣器驱动模块
*	文件名称 : bsp_beep.c
*	版    本 : V1.0
*	说    明 : 驱动蜂鸣器，配合新建工程使用，非完整文件
*
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0   2023-04-28  范佳倩   首发
*
*	Copyright (C), 2014-2019, 德致伦电子
*
*********************************************************************************************************
*/

#include "bsp.h"
#include "bsp_beep.h"


/*
*********************************************************************************************************
*	函 数 名: bsp_InitBeep
*	功能说明: 配置蜂鸣器相关的GPIO,  该函数被 bsp_Init() 调用。
*	形    参:  无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_InitBeep(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
	
	/* 打开GPIO时钟 */
	RCC_APB2PeriphClockCmd(RCC_ALL_BEEP, ENABLE);
	
	
	/*
	配置蜂鸣器GPIO为推挽输出模式
	由于将GPIO设置为输出时，GPIO输出寄存器的值缺省是0，因此不会驱动蜂鸣器鸣叫
	*/

	
	//GPIO_SetBits(LED0_GPIO_PORT,LED0_GPIO_PIN);

	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;	/* 推挽输出模式 */
	
	GPIO_InitStructure.GPIO_Pin = BEEP_GPIO_PIN;
	GPIO_Init(BEEP_GPIO_PORT, &GPIO_InitStructure);

}



/*
*********************************************************************************************************
*	函 数 名: bsp_BeepOn
*	功能说明: 鸣叫蜂鸣器
*	形    参:  _
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_BeepOn(void)
{
	BEEP=1;
}
/*
*********************************************************************************************************
*	函 数 名: bsp_BeepOff
*	功能说明: 静音蜂鸣器
*	形    参:  
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_BeepOff(void)
{
	BEEP=0;
}


/*
*********************************************************************************************************
*	函 数 名: bsp_BeepToggle
*	功能说明: 翻转蜂鸣器。
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_BeepToggle(void)
{
	BEEP_GPIO_PORT->ODR^=BEEP_GPIO_PIN;
}
/*
*********************************************************************************************************
*	函 数 名: bsp_IsBeepOn
*	功能说明: 判断蜂鸣器是否已经鸣叫
*	形    参:  无
*	返 回 值: 1表示已经鸣叫，0表示静音
*********************************************************************************************************
*/
uint8_t bsp_IsBeepOn(void)
{
	if((BEEP_GPIO_PORT->ODR & BEEP_GPIO_PIN)==BEEP_GPIO_PIN)
	{
		return 1;
	}
	return 0;
		
}


/***************************** 德致伦电子 DeZLinc (END OF FILE) *********************************/
