/*
*********************************************************************************************************
*
*	模块名称 : 模块
*	文件名称 : bsp_tim_pwm.h
*	说    明 : 
*	修改记录 :
*		版本号  日期   2023-5-17     说明
*		V1.0    
*
*	Copyright (C), 2014-2019, 德致伦电子
*
*********************************************************************************************************
*/
#ifndef __BSP_TIM_PWM_H
#define __BSP_TIM_PWM_H

///////////////////////////////////////
/* 头文件包含区 */
#include "sys.h"
///////////////////////////////////////
/* 宏定义区域 */

///////////////////////////////////////
/* 外部变量申明区 */

///////////////////////////////////////
/* 函数申明区 */

void bsp_SetTIMOutPWM(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, TIM_TypeDef* TIMx, uint8_t _ucChannel,uint32_t _ulFreq, uint32_t _ulDutyCycle);
void bsp_SetTIMforInt(TIM_TypeDef* TIMx, uint32_t _ulFreq, uint8_t _PreemptionPriority, uint8_t _SubPriority);

///////////////////////////////////////
#endif
/***************************** 德致伦电子 DeZLinc (END OF FILE) *********************************/
