

#include "bsp.h"				/* 底层硬件驱动 */

#include "bsp_exti.h"


/*
*********************************************************************************************************
*	函 数 名: main
*	功能说明: c程序入口
*	形    参：无
*	返 回 值: 
*********************************************************************************************************
*/
int main(void)
{
	//uint8_t ucKeyCode;
	/*
		ST固件库中的启动文件已经执行了 SystemInit() 函数，该函数在 system_stm32f10x.c 文件，主要功能是
	配置CPU系统的时钟
	*/
	bsp_Init();		/* 硬件初始化 */

	bsp_InitKeyEXTI();/*按键外部中断的初始化*/
	while(1)
	{
		bsp_Idle();/*CPU空闲时执行的函数，在bsp.c*/
	}
}	


/***************************** 德致伦电子 DeZLinc (END OF FILE) *********************************/
