/*
*********************************************************************************************************
*
*	模块名称 : 模块
*	文件名称 : IWDG.h
*	说    明 : 
*	修改记录 :
*		版本号  日期        作者     说明
*		V1.0    xxx-xx-xx
*
*	Copyright (C), 2014-2019, 德致伦电子
*
*********************************************************************************************************
*/
#ifndef _BSP_IWDG_H
#define _BSP_IWDG_H

#include "sys.h"

/** 描述 :独立看门狗初始化*/
void bsp_InitIwdg(uint8_t _uIWDGPrer,uint32_t _ulIWDGRlr);
 
/** 描述 :喂独立看门狗*/
void IWDG_Feed(void);

#endif
